cask_args appdir: '/Applications'

#tap 'caskroom/cask'
#tap 'neovim/neovim'
#tap 'nexeck/tmuxinator'
tap 'homebrew/cask-versions'

# Gnu tools
brew 'coreutils'
brew 'binutils'
brew 'findutils', args: ['with-default-names']
brew 'gnu-indent'
brew 'gnu-sed', args: ['with-default-names']
brew 'gnu-tar', args: ['with-default-names']
brew 'gnu-which', args: ['with-default-names']
brew 'gnutls', args: ['with-default-names']
brew 'grep', args: ['with-default-names']
brew 'gawk'
brew 'gzip'
brew 'wdiff'
brew 'make', args: ['with-default-names']
brew 'xz'
brew 'watch'

# Font
cask 'caskroom/fonts/font-hack-nerd-font'

# brewing aux. development software
brew 'file-formula'
brew 'git'
brew 'less'
brew 'openssh'
brew 'rsync'
brew 'p7zip'
brew 'tmux'
brew 'neovim', args: ['override-system-vi']
brew 'asdf'
brew 'zsh'
brew 'ack'
brew 'curl'
brew 'curl-openssl'
brew 'bashful'
brew 'mas'

brew 'docker-clean'
brew 'git'
brew 'git-extras'
brew 'git-secrets'
brew 'go-jira'
brew 'gradle'
brew 'htop'
brew 'docker-completion'
brew 'gradle-completion'


# My tools
cask 'nextcloud'
brew 'duc'
brew 'fx'
brew 'jq'
brew 'kube-ps1'
brew 'kubectx'
brew 'kubernetes-cli'
brew 'lastpass-cli'
brew 'ncdu'
brew 'mosh'
brew 'thefuck'
brew 'task'
brew 'taskd'
brew 'tasksh'
brew 'terminal-notifier'
brew 'the_silver_searcher'
brew 'sslscan'
brew 'python3'
brew 'nmap'
brew 'noti'
brew 'parallel'
brew 'tig'
brew 'tldr'
brew 'midnight-commander'
cask 'p4merge'
cask 'sequel-pro'
cask 'sourcetree-beta'
cask 'spotify'
cask 'trailer'
cask 'tusk'
cask 'virtualbox'
cask 'visual-studio-code'
cask 'viscosity'
cask 'google-drive-file-stream'
cask 'alfred'
cask 'dash3'
cask 'appcleaner'
cask 'iterm2-beta'


cask 'visual-studio-code'
cask 'chromedriver'

# MAS
mas 'Slack', id: 803453959
mas 'Xcode', id: 497799835
mas 'Microsoft Remote Desktop', id: 1295203466
mas 'App Cleaner', id: 1013897218
mas 'Chat for Facebook', id: 1004520921

# Core Homebrew
# brew 'adns'
# brew 'aspell'
# brew 'bash-completion'
# brew 'brotli'
# brew 'c-ares'
# brew 'cairo'
# brew 'cmake'
# brew 'ctags'
# brew 'e2fsprogs'
# brew 'ext4fuse'
# brew 'fd'
# brew 'flac'
# brew 'fontconfig'
# brew 'freetype'
# brew 'fribidi'
# brew 'fswatch'
# brew 'gd'
# brew 'gdbm'


# brew 'graphite2'
# brew 'harfbuzz'
# brew 'hyperfine'
# brew 'icu4c'
# brew 'ilmbase'
# brew 'infer'

# brew 'nettle'
# brew 'nghttp2'
# brew 'node'
# brew 'npth'
# brew 'oniguruma'
# brew 'openconnect'
# brew 'openldap'
# brew 'openssl'
# brew 'openssl@1.1'
# brew 'p11-kit'
# brew 'pango'

# brew 'pcre'
# brew 'pcre2'
# brew 'perl'
# brew 'pinentry'
# brew 'pixman'
# brew 'pkg-config'
# brew 'protobuf'
# brew 'python'
# brew 'python@2'
# brew 'readline'
# brew 'rtmpdump'
# brew 'ruby'
# brew 's-lang'
# brew 'sqlite'
# brew 'stoken'

# brew 'tokyo-cabinet'
# brew 'unbound'
# brew 'unibilium'
# brew 'vgo'
# brew 'watch'
# brew 'webp'
# brew 'wget'
# brew 'wireshark'
# brew 'xz'

# # Cask Apps
# cask 'adobe-air'
# cask 'adobe-creative-cloud'

# cask 'alfred'
# cask 'appcleaner'
# cask 'blue-jeans'
# cask 'meld'
# cask 'kap'

# cask 'messenger-native'
# cask 'cakebrew'
# cask 'chromedriver'
# cask 'cyberduck'
# cask 'darktable'
# cask 'dash3'
# cask 'flashlight'
# cask 'gdisk'
# cask 'gimp'
# cask 'github-beta'
# cask 'githubpulse'
# cask 'google-drive-file-stream'
# cask 'graphiql'
# cask 'insomnia'
# cask 'jqbx'
# cask 'keka'
# cask 'mac2imgur'
# cask 'macdown'
# cask 'minikube'
# cask 'mysimbl'
# cask 'mysqlworkbench'

# cask 'ngrok'
# cask 'nvalt'
# cask 'osxfuse'
# cask 'skim'
# cask 'taskwarrior-pomodoro'
# cask 'teamviewer'
# cask 'terraform-0.10.7'
# cask 'terraform-0.11.10'
# cask 'terraform-0.11.8'
# cask 'terraform-0.8.8'
# cask 'vlc'
# cask 'vnc-viewer'
# cask 'yed'

